src/Catalogs/ПоказателиИнцидентов/ПоказателиИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиИнцидентов</name>
  <owners>Catalog.ОбнаружениеИнцидентов</owners>
  <attributes>
    <name>Функция</name>
    <type>
      <types>EnumRef.ФункцииОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ЧислоНовыхОбъектов</types>
      <types>CatalogRef.ЧислоПаденийРабочихПроцессов</types>
      <types>CatalogRef.ЧислоСеансовПользователей</types>
      <types>CatalogRef.ИспользованиеОперативнойПамятиПроцессамиКластера</types>
      <types>CatalogRef.ПоказателиAPDEX</types>
      <types>CatalogRef.СкоростьРазбораПроблем</types>
      <types>CatalogRef.ТекущееЧислоВызововСервера</types>
      <types>CatalogRef.ЧислоИсключенийПоТехнологическомуЖурналу</types>
      <types>CatalogRef.ОценкаПользователей</types>
      <types>CatalogRef.ПроцентДоступностиСервисаВсеБазы</types>
      <types>CatalogRef.СформированоОтчетов</types>
      <types>CatalogRef.ПоказателиСкоростиВыполненияТипичныхОпераций</types>
      <types>CatalogRef.ЧислоНерешенныхПроблем</types>
      <types>CatalogRef.ПроцентДоступностиСервисаВсеРесурсы</types>
      <types>CatalogRef.ПоказателиСчетчиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениИнтервалаРасчета</name>
    <type>
      <types>EnumRef.ЕдиницыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>СравниватьСПрошлым</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеБазы</name>
    <type>
      <types>EnumRef.ВариантыСмещенияБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалБазы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениИнтервалаБазы</name>
    <type>
      <types>EnumRef.ЕдиницыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСравнения</name>
    <type>
      <types>EnumRef.ВидыСравненияПоказателейОповещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Порог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматнаяСтрокаЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыСравненияПоказателейОповещения/ВидыСравненияПоказателейОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСравненияПоказателейОповещения</name>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>Изменился</name>
  </enumValues>
  <enumValues>
    <name>Между</name>
  </enumValues>
  <enumValues>
    <name>БольшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>МеньшеИлиРавно</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ПоказателиСчетчиков/ПоказателиСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиСчетчиков</name>
  <owners>Catalog.ПоказателиМониторинга</owners>
  <owners>Catalog.ПоказателиОповещений</owners>
  <owners>Catalog.ПоказателиИнцидентов</owners>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТипаПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикиВыбран</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикиРежимВыбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Счетчики</name>
    <attributes>
      <name>Счетчик</name>
      <type>
        <types>CatalogRef.ГруппыСчетчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АвтовыборПараметры</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеУсловия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеСоединения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ПоказателиИнцидентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает новый показатель инцидента у которого тип реквизита "Показатель" равен
// типу СправочникСсылка.ПоказателиСчетчиков
//  Параметры:
//    Владелец  - СправочникСсылка.ОбнаружениеИнцидентов - владелец нового элемента
//    Счетчик   - СправочникСсылка.ГруппыСчетчиков - счетчик для создания показателя
//    Параметры - Структура                         - структура создания показателя с ключами:
//                                                    Функция                        - ПеречислениеСсылка.ФункцииОповещений
//                                                    ИнтервалРасчета                - Число(10,0)
//                                                    ЕдиницаВремениИнтервалаРасчета - ПеречислениеСсылка.ЕдиницыВремени
//                                                    ВидСравнения                   - ПеречислениеСсылка.ВидыСравненияПоказателейОповещения
//                                                    Порог                          - Число(15,4)
//                                                    ФорматнаяСтрокаЗначения        - Строка
//                                                    Аналитика                      - ПеречислениеСсылка.АналитикаСчетчиков
//                                                    Периодичность                  - ПеречислениеСсылка.ПериодичностьСчетчиков
//                                                    ПорогДо                        - Число(15,4), обязателен, если ВидСравнения = Между
//                                                    ПорогВПроцентах                - Булево, обязателен, если ВидСравнения = Изменился
//                                                    СмещениеБазы                   - ПеречислениеСсылка.ВариантыСмещенияБазы, обязателен,
//                                                                                     если ВидСравнения = Изменился
//
Функция СоздатьЭлементПоСчетчику(Владелец, Счетчик, Параметры) Экспорт
    
    ПоказательИнцидента = Справочники.ПоказателиИнцидентов.СоздатьЭлемент();
    ПоказательИнцидента.Владелец = Владелец;
    ПоказательИнцидента.УстановитьСсылкуНового(Справочники.ПоказателиИнцидентов.ПолучитьСсылку());
    ПоказательИнцидента.Функция = Параметры.Функция;
    
    ПараметрыПоказателя = Новый Структура;
    ПараметрыПоказателя.Вставить("Аналитика", Параметры.Аналитика);
    ПараметрыПоказателя.Вставить("Периодичность", Параметры.Периодичность);
    ПараметрыПоказателя.Вставить("РегулярноеВыражениеПоиска", Параметры.РегулярноеВыражениеПоиска);
    ПараметрыПоказателя.Вставить("РегулярноеВыражениеЗамены", Параметры.РегулярноеВыражениеЗамены);
    
    Показатель = Справочники.ПоказателиСчетчиков.СоздатьЭлементПоСчетчику(ПоказательИнцидента.ПолучитьСсылкуНового(), Счетчик, ПараметрыПоказателя);
    
    ПоказательИнцидента.Показатель = Показатель;
    
    ПоказательИнцидента.ИнтервалРасчета = Параметры.ИнтервалРасчета;
    ПоказательИнцидента.ЕдиницаВремениИнтервалаРасчета = Параметры.ЕдиницаВремениИнтервалаРасчета;
    ПоказательИнцидента.ВидСравнения = Параметры.ВидСравнения;
    ПоказательИнцидента.Порог = Параметры.Порог;
    ПоказательИнцидента.ФорматнаяСтрокаЗначения = Параметры.ФорматнаяСтрокаЗначения;
    
    Если Параметры.ВидСравнения = Перечисления.ВидыСравненияПоказателейОповещения.Между Тогда
        ПоказательИнцидента.ПорогДо = Параметры.ПорогДо;
    КонецЕсли;
    
    Если Параметры.ВидСравнения = Перечисления.ВидыСравненияПоказателейОповещения.Изменился Тогда
        ПоказательИнцидента.ПорогВПроцентах = Параметры.ПорогВПроцентах;
        ПоказательИнцидента.СмещениеБазы = Параметры.СмещениеБазы;
    КонецЕсли;
    
    
    ПоказательИнцидента.Записать();
    Возврат ПоказательИнцидента;
    
КонецФункции

Функция СоздатьЭлементXML(Параметры) Экспорт
    
    НовыйПоказатель = Справочники.ПоказателиИнцидентов.СоздатьЭлемент();
	НовыйПоказатель.УстановитьСсылкуНового(Справочники.ПоказателиИнцидентов.ПолучитьСсылку());
	НовыйПоказатель.Владелец = Параметры.Владелец;
	НовыйПоказатель.Функция = Параметры.Функция;
	НовыйПоказатель.ИнтервалРасчета = Параметры.ИнтервалРасчета;
	НовыйПоказатель.ЕдиницаВремениИнтервалаРасчета = Параметры.ЕдиницаВремениИнтервалаРасчета;
	НовыйПоказатель.ФорматнаяСтрокаЗначения = Параметры.ФорматнаяСтрокаЗначения;
	НовыйПоказатель.ВидСравнения = Параметры.ВидСравнения;
	НовыйПоказатель.Порог = Параметры.Порог;
	НовыйПоказатель.ПорогВПроцентах = Параметры.ПорогВПроцентах;
	НовыйПоказатель.СравниватьСПрошлым = Параметры.СравниватьСПрошлым;
	НовыйПоказатель.СмещениеБазы = Параметры.СмещениеБазы;
	
	Поток = Новый ЗаписьXML();
	Поток.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(Поток, НовыйПоказатель);
	
	ПоказательРезультат = Новый Соответствие;
	ПоказательРезультат.Вставить("СсылкаПоказательИнцидента", НовыйПоказатель.ПолучитьСсылкуНового());
	ПоказательРезультат.Вставить("ПоказательИнцидентаXML", Поток.Закрыть());
	
	Возврат ПоказательРезультат;
    
КонецФункции

#КонецОбласти
    
#Область ПредопределенныеПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	Попытка
		Представление = Данные.Ссылка.Показатель;
		СтандартнаяОбработка = Ложь;
	Исключение
		СтандартнаяОбработка = Истина;
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
